
[
  {
    "title": "A Promised Land",
    "author": "Barack Obama",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1600357110l/55361205._SX98_.jpg",
    "status": "Currently Reading",
    "review": "I'm reading this trying to understand the gap between what gets celebrated in presidential rhetoric and what actually shifts power structures. How much does individual agency matter when you're embedded in institutions designed to resist transformation? Obama's reflections on compromise make me question whether incrementalism is strategic necessity or just another way of deferring the deeper question: whose dignity gets traded away in the name of pragmatism?"
  },
  {
    "title": "Building a Second Brain: A Proven Method to Organize Your Digital Life and Unlock Your Creative Potential",
    "author": "Tiago Forte",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1652891488l/59616977._SX98_.jpg",
    "status": "Currently Reading",
    "review": "There's something both useful and deeply troubling about productivity optimization culture. Forte's system works—I use parts of it—but I keep asking: does organizing my information build solidarity or just make me a more efficient individual while the systems around me stay extractive? Personal knowledge management feels like a hedge against institutional failure rather than a challenge to it."
  },
  {
    "title": "Together: Why Social Connection Holds the Key to Better Health, Higher Performance, and Greater Happiness",
    "author": "Vivek H. Murthy",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1569893285l/43309159._SX98_.jpg",
    "status": "Currently Reading",
    "review": "Murthy treats loneliness as a medical condition, which is both revelatory and limiting. Yes, isolation damages our health—but when does framing connection through health outcomes and performance metrics medicalize something that's fundamentally about how we've built systems that fracture community? I'm reading this alongside my work on solidarity infrastructure, noticing where the clinical lens illuminates and where it obscures."
  },
  {
    "title": "The Spirit Catches You and You Fall Down",
    "author": "Anne Fadiman",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1432610033l/12609._SY75_.jpg",
    "status": "Favorite",
    "review": "This book haunts me because it refuses to resolve the tragedy it documents. Fadiman shows how a medical system and a Hmong family both acting with care can still produce devastating outcomes when institutions can't see beyond their own frameworks. It's not about individual prejudice—it's about how systems built on monolingual, monocultural assumptions do violence even when individuals mean well. Every time I design something meant to 'help,' I think about Lia Lee and ask: whose meaning-making am I erasing?"
  },
  {
    "title": "What I Know for Sure",
    "author": "Oprah Winfrey",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1400988917l/21531503._SY75_.jpg",
    "status": "Favorite",
    "review": "Winfrey's certainty is earned, not performed—and that distinction matters. I keep this as a favorite not because I agree with everything, but because it reminds me that personal wisdom and systemic critique aren't opposed. She writes about resilience without pretending individual strength fixes structural violence. There's something powerful about claiming 'what I know for sure' while acknowledging that certainty doesn't erase complexity."
  },
  {
    "title": "When Breath Becomes Air",
    "author": "Paul Kalanithi",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1492677644l/25899336._SX50_.jpg",
    "status": "Favorite",
    "review": "Kalanithi writes from the intersection of doctor and patient, and that dual perspective reveals what medical training systematically erases: how to hold meaning when the body fails. His neurosurgical precision meets mortality, and instead of resolution he offers something harder—living in the tension between extending life and making it meaningful. I return to this when I need to remember that some questions shouldn't be optimized away."
  },
  {
    "title": "Human Acts",
    "author": "Han Kang",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1728665520i/30091914._SX98_.jpg",
    "status": "To Read",
    "review": "On my list because I need to understand how state violence against students gets remembered and resisted. The Gwangju Uprising isn't just historical—it's about what happens when a state decides certain bodies don't deserve dignity, and how literature can refuse that erasure. I'm interested in how Kang writes the aftermath, not just the event itself."
  },
  {
    "title": "Last Night I Dreamed of Peace",
    "author": "Đặng Thùy Trâm",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1355658669i/3587865._SX98_.jpg",
    "status": "To Read",
    "review": "A Vietnamese doctor's diary from the war—I want to read how someone records daily life while their world is being destroyed. There's something about diaries written during violence that resists the sanitized narratives we get later. Witnessing in real time, before anyone knows how the story ends."
  },
  {
    "title": "Kampong Boy",
    "author": "Lat",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1316727896i/635606._SX98_.jpg",
    "status": "To Read",
    "review": "A Malaysian childhood memoir that might help me understand belonging in Southeast Asia beyond the academic frameworks I usually encounter. I'm looking for the texture of daily life, the specific details of how community worked before certain kinds of modernization reshaped it. Graphic novel form matters too—what does visual storytelling reveal that prose can't?"
  },
  {
    "title": "Liberté, Egalité, Fraternité",
    "author": "Cynthia Fleury",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1631202282i/58547438._SX98_.jpg",
    "status": "To Read",
    "review": "Picked this up because I'm trying to understand the lineage of solidarity frameworks—how 'fraternité' gets deployed, what it promises, where it fails. The French Revolution's language still shapes how we think about collective obligation, but whose brotherhood was actually meant? I'm suspicious and curious in equal measure."
  },
  {
    "title": "The Empathy Exams: Essays",
    "author": "Leslie Jamison",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1405924561i/17934655._SX98_.jpg",
    "status": "To Read",
    "review": "Jamison writes about performing empathy as a medical actor for student doctors, and I need that analysis. How do you distinguish genuine care from competent performance? When I build systems meant to be 'empathetic,' am I creating infrastructure for solidarity or just better scripts for appearing to care? This question keeps me up at night."
  },
  {
    "title": "Against Happiness: In Praise of Melancholy",
    "author": "Eric G. Wilson",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1438474855i/1298834._SX98_.jpg",
    "status": "To Read",
    "review": "I'm tired of optimization culture demanding constant happiness. Melancholy isn't depression—it's a way of sitting with difficulty without rushing to resolution. I want to read someone who treats sustained discomfort as intellectually valuable rather than a problem to be solved. Resisting the pressure to perform positivity feels increasingly urgent."
  },
  {
    "title": "The Tyranny of Merit: What's Become of the Common Good?",
    "author": "Michael J. Sandel",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1594431563i/50364458._SX98_.jpg",
    "status": "Read",
    "review": "Sandel articulates something I've felt but couldn't name: how meritocracy doesn't just fail to deliver opportunity—it actively corrodes dignity by suggesting your worth equals your market value. The 'you deserve your success' logic necessarily implies others deserve their suffering. I read this while thinking about the migrant workers I work with, whose labor is essential but whose dignity gets denied by the very systems that claim to reward merit. The book doesn't resolve the tension between recognizing talent and maintaining solidarity, and I'm grateful for that honesty."
  },
  {
    "title": "What We Owe Each Other",
    "author": "T.M. Scanlon",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1386920792i/278553._SX98_.jpg",
    "status": "Read",
    "review": "Scanlon's contractualism asks: what principles for living together could no one reasonably reject? It's a deceptively simple question that cuts through a lot of abstract philosophy. I appreciate that he grounds moral obligation in relationships rather than universal rules or consequences. But I keep pushing on 'reasonable rejection'—reasonable according to whom? Whose reasoning counts? The framework is powerful, but I'm still working through how it handles power asymmetries where some people's reasons systematically don't get heard."
  }
]