[
  {
    "title": "Determined: A Science of Life without Free Will",
    "author": "Robert M. Sapolsky",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1685350965l/83817782._SX300_.jpg",
    "status": "Favorite",
    "review": "finished this one on a tube in london with minh (@minh you probably remember the tattered pages). picked this up expecting an argument and got something closer to an autopsy. sapolsky isn't interested in comforting anyone; he just keeps peeling back layers until \"choice\" starts to look like a story we tell ourselves after the fact.what felt refreshing was the angle. free will is usually debated in philosophy seminars, abstract and circular. here it's treated as a biological question, and that shift quietly dismantles an entire moral economy. praise, blame, deservingness, all the invisible accounting we do, starts to feel mispriced.growing up conditioned to treat meritocracy as sacrosanct, this landed uncomfortably close. effort, discipline, ambition, even shame, framed not as virtues or failures but as outcomes. products of biology, upbringing, timing. the mirror stops accusing and starts explaining.the book does rush past philosophy though. attempts to rescue free will get dismissed pretty quickly, which feels abrupt compared to how carefully the neuroscience is handled. for something that dismantles meaning so thoroughly, the impatience with centuries of thought feels narrow.still, there's a strange relief here. if no one truly earns their advantages or deserves their failures, maybe the cruelty we apply, especially to ourselves, was never necessary.",
    "link": "https://www.goodreads.com/review/show/8310851784?utm_medium=api&utm_source=rss"
  },
  {
    "title": "A Journey in Ladakh: Encounters with Buddhism",
    "author": "Andrew Harvey",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1382945883l/61113._SX300_.jpg",
    "status": "Favorite",
    "review": "i'll admit i was skeptical at first; another 'westerner' wandering into the himalayas for enlightenment? but harvey disarmed that cynicism almost immediately. the writing itself is vividly immersive. the colors, smells, sounds of ladakh come alive. it's almost like you're not reading about the journey but you're walking it.overall, what's really striking is the intellectual honesty in that he doesn't cherry-pick buddhism the way some western seekers do.. he interrogates it, sits with its paradoxes, questions whether the pursuit of ego-death can itself become an ego exercise. that reflexivity extends beyond spirituality in how he observes how poets and artists can be equally self-absorbed, caught in the hunger to \"shape the world in their image\". this kinda hit me close as i've been exploring poetry myself.the afterword does complicate some things. harvey doesn't romanticize tibet and he acknowledges the patriarchal, elitist, hierarchical structures of tibetan society, the commodification of practices, the controversies even around figures like the dalai lama. but he carefully distinguishes these human and political limitations from the spiritual \"technology\" itself. social systems may falter or corrupt, but the essence of the teachings retains transformative power.reading this has made me realize how much of my own understanding of buddhism has been taoist-inspired (flow and harmony)rather than traditional buddhist discipline. harvey's work opened me up to its depth: karuna (compassion), active empathy and bodhicitta (mind of enlightenment or awakened heart-mind), discipline/rigor in the five precepts, the humility required to truly engage with reality and face impermanence rather than construct comfortable versions of it?there's an anecdote that's stayed with me: \"i lost my beloved. i looked for him everywhere. i looked for him in the hills. i looked at him by the sea. i found him, alas, in the corner of my own house.\" its the same anecdote that sat with my friend who recommended the book to me as he was traveling through nepal.. maybe its a sign to embark on a journey of self-realisation? (bookmark for another time lol)",
    "link": "https://www.goodreads.com/review/show/8260558214?utm_medium=api&utm_source=rss"
  },
  {
    "title": "Dreams from My Father: A Story of Race and Inheritance",
    "author": "Barack Obama",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1352340675l/88061._SX300_.jpg",
    "status": "Favorite",
    "review": "I came across Dreams from My Father essentially by accident at a bookstore in Ipoh. I remember thinking, having already read (and listened to) A Promised Land when it first came out, skimming through the more technical bits: \"do I really need another Obama book?\" I felt like I already knew the arc, the ideas, the public version of the man.But reading it now, after university, after entering the working world, and after having the privilege of working more closely in a team with colleagues from across the African continent, I've been able to parse through Obama's journey with a different lens. His reflections on growing up across countries, moving between worlds, and learning how to read himself through other people's expectations are well-documented. What stayed with me most, though, was the chapter where he \"returns\" to Kenya and the subtle discomfort that came along with it.The discrepancies he encounters as a son, as \"kin\", as someone who is technically from there but also not, felt rather familiar. It made me think about my own position as a member of the Mauritian disapora: African? Indian? something in between and sometimes neither... What does it mean to inherit a place without fully belonging to it? And to an extent, what, if anything, does that inheritance demand of me? These are questions I'm trying to interrogate but reading him made me feel that maybe sitting with the discomfort is itself part of the work.I was also struck by how early his thinking about law appears, not as something abstract or procedural, but as a moral project. His suggestion that law is a way for a nation to examine its conscience feels especially resonant now. Law, in this framing, isn't just about order or rights, but about who we decide counts, whose injuries are legible, and what kinds of obligations we are willing to acknowledge to one another as a community. That idea of community, not as sentiment but as responsibility, threads through the book fairly persistently.Reading Dreams from My Father like this makes me want to return to The Audacity of Hope and A Promised Land, but more slowly this time, with better questions. Less about the statesman version, more about how you build a legal/political imagination when you never really \"land\" anywhere..",
    "link": "https://www.goodreads.com/review/show/8249710704?utm_medium=api&utm_source=rss"
  },
  {
    "title": "Where I Was: A Memoir About Forgetting and Remembering",
    "author": "Constance Singam",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1647605840l/60528975._SX300_.jpg",
    "status": "Favorite",
    "review": "a friend introduced me to singam's work and what strikes me most is how the memoir captures the internal contradictions of advocacy work. i.e even within AWARE's leadership, feminism meant different things to different people while also uncovering a reality of coalition-building.there's this observation about the \"package deal\" problem: if you identify as feminist, do you also need positions on lesbian rights, homosexuality, sex work? where do the boundaries lie, and who decides which struggles are legitimately connected? mostly, the memoir reveals how advocacy work in singapore involves constant navigation - of structural barriers, strategic compromises, the negotiation between what's possible and what's necessary. the questions it raises feel more valuable than any definitive answers it might offer.",
    "link": "https://www.goodreads.com/review/show/8283987761?utm_medium=api&utm_source=rss"
  },
  {
    "title": "Letters to a Young Poet",
    "author": "Rainer Maria Rilke",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1321994947l/46199._SX300_.jpg",
    "status": "Favorite",
    "review": "a friend kindly gifted the book towards the end of 2025. it genuinely stills enthralls me, how a string of words put together by men corresponding by mail, could have such a visceral impact. this quote \" I beg you, to have patience with everything unresolved in your heart and to try to love the questions themselves as if they were locked rooms or books written in a very foreign language. Don’t search for the answers, which could not be given to you now, because you would not be able to live them. And the point is to live everything. Live the questions now. Perhaps then, someday far in the future, you will gradually, without even noticing it, live your way into the answer\" from Rilke in his correspondence to Kappus, essentially articulating that some questions cannot be answered intellectually or prematurely. trusting that emotional ambiguity doesn't always need to be interrogated is not an easy pill to swallow but perhaps a useful heuristic to employ for certain situations.",
    "link": "https://www.goodreads.com/review/show/8249710167?utm_medium=api&utm_source=rss"
  },
  {
    "title": "Against Happiness: In Praise of Melancholy",
    "author": "Eric G. Wilson",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1438474855l/1298834._SX300_.jpg",
    "status": "Favorite",
    "review": "chanced upon the book at the reference section of the library. the cover seemed deceiving (another self-help drudgery?) but wilson takes the reader on a socio-political journey examining the merits of melancholy and isolation. his thesis that treats sustained discomfort as intellectually valuable rather than a problem to be solved can be contentious but one that perhaps should be interrogated in light of \"happiness metrics\" or the idea that happiness can be optimized like productivity.there's discourse on the idea of tragic humanism (https://www.theguardian.com/commentis...), the belief that meaning emerges not from comfort or salvation, but from confronting suffering, limitation, and the absurdity of the human condition.wilson doesn’t resolve whether a difficult, unresolved life is a \"good\" one, but perhaps the refusal to resolve it is his own subtle provocation.",
    "link": "https://www.goodreads.com/review/show/8253953825?utm_medium=api&utm_source=rss"
  },
  {
    "title": "Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones",
    "author": "James Clear",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1655988385l/40121378._SX300_.jpg",
    "status": "Favorite",
    "review": "Clear essentially repurposed many existing frameworks but packaged them into a nice concise and well organized read. One key framework that I found useful was the \"If-then\" method to better prepare for the internal roadblocks that would arise given our tendency to rely on inertia when making decisions. Sometimes success is less about making good habits easy but making bad habits hard.",
    "link": "https://www.goodreads.com/review/show/6660158721?utm_medium=api&utm_source=rss"
  },
  {
    "title": "Deep Work: Rules for Focused Success in a Distracted World",
    "author": "Cal Newport",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1447957962l/25744928._SX300_.jpg",
    "status": "Favorite",
    "review": "Actionable steps on how to foster a less distracting environment though i question how relevant the strategies are given the prevalence of apps being used in study/work environments",
    "link": "https://www.goodreads.com/review/show/4452912152?utm_medium=api&utm_source=rss"
  },
  {
    "title": "The Third Door: The Wild Quest to Uncover How the World's Most Successful People Launched Their Careers",
    "author": "Alex Banayan",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1527724477l/36739769._SX300_.jpg",
    "status": "Favorite",
    "review": "Great read for any aspiring or budding entrepreneur. Banayan gives a candid overlook of some of the highs and lows that well known entrepreneurs have experienced and peels behind some common misconceptions behind successful entrepreneurs and their journeys",
    "link": "https://www.goodreads.com/review/show/4726950183?utm_medium=api&utm_source=rss"
  },
  {
    "title": "Anything You Want",
    "author": "Derek Sivers",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1608491606l/11878168._SX300_.jpg",
    "status": "Favorite",
    "review": "Must read for anyone wanting to dive into entrepreneurship or for existing entrepreneurs who need a fresh perspective on why they started their venture",
    "link": "https://www.goodreads.com/review/show/4726953986?utm_medium=api&utm_source=rss"
  },
  {
    "title": "Tuesdays with Morrie: An Old Man, a Young Man, and Life's Greatest Lesson",
    "author": "Mitch Albom",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1423763749l/6900._SX300_.jpg",
    "status": "Favorite",
    "link": "https://www.goodreads.com/review/show/4442664823?utm_medium=api&utm_source=rss"
  },
  {
    "title": "What I Know for Sure",
    "author": "Oprah Winfrey",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1400988917l/21531503._SX300_.jpg",
    "status": "Favorite",
    "review": "Winfrey gives an illustrious look into the various life lessons she has garnered through both triumphs and falls. She summarizes all of her experiences into bite-sized gold nuggets, allowing the reader a peek into her spiritual ways that have guided her mindset and way of thinking.",
    "link": "https://www.goodreads.com/review/show/4117308492?utm_medium=api&utm_source=rss"
  },
  {
    "title": "The Spirit Catches You and You Fall Down: A Hmong Child, Her American Doctors, and the Collision of Two Cultures",
    "author": "Anne Fadiman",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1432610033l/12609._SX300_.jpg",
    "status": "Favorite",
    "review": "Fadiman's writing will tug the heart of any reader.",
    "link": "https://www.goodreads.com/review/show/4096312072?utm_medium=api&utm_source=rss"
  },
  {
    "title": "Range: Why Generalists Triumph in a Specialized World",
    "author": "David   Epstein",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1550048292l/41795733._SX300_.jpg",
    "status": "Favorite",
    "link": "https://www.goodreads.com/review/show/3951357740?utm_medium=api&utm_source=rss"
  },
  {
    "title": "Hooked: How to Build Habit-Forming Products",
    "author": "Nir   Eyal",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1407112405l/22668729._SX300_.jpg",
    "status": "Read",
    "review": "While slanted to software products, Eyal's Hook model provides substantiative insights into techniques and methods to increase user adoption and improve retention. Necessary reading for any SaaS entrepreneur.",
    "link": "https://www.goodreads.com/review/show/4080756057?utm_medium=api&utm_source=rss"
  },
  {
    "title": "The Subtle Art of Not Giving a F*ck: A Counterintuitive Approach to Living a Good Life",
    "author": "Mark Manson",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1465761302l/28257707._SX300_.jpg",
    "status": "Read",
    "review": "A practical and funny guide to not getting too heavy handed with life's sometimes unpleasant encounters.",
    "link": "https://www.goodreads.com/review/show/2467145335?utm_medium=api&utm_source=rss"
  },
  {
    "title": "When Breath Becomes Air",
    "author": "Paul Kalanithi",
    "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1492677644l/25899336._SX300_.jpg",
    "status": "Read",
    "review": "An amazing view of Paul's life and how he powered through adversity to continue living in the face of deaths and despair. Truly inspiring.",
    "link": "https://www.goodreads.com/review/show/2467144716?utm_medium=api&utm_source=rss"
  }
]